{"modelTopology": {"training_config": {"sample_weight_mode": null, "loss": "mean_squared_error", "metrics": [], "optimizer_config": {"class_name": "RMSprop", "config": {"rho": 0.8999999761581421, "lr": 0.0010000000474974513, "epsilon": 1e-07, "decay": 0.0}}, "loss_weights": null}, "backend": "tensorflow", "keras_version": "2.1.5", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "bias_constraint": null, "units": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activation": "relu", "batch_input_shape": [null, 40, 1], "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "bias_constraint": null, "recurrent_dropout": 0.0, "return_sequences": false, "batch_input_shape": [null, 5, 1], "recurrent_activation": "hard_sigmoid", "trainable": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "stateful": false, "unit_forget_bias": true, "implementation": 1, "dropout": 0.0, "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "name": "lstm_1", "activation": "tanh", "unroll": false, "kernel_regularizer": null, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}]}}, "weightsManifest": [{"weights": [{"name": "dense_1/kernel", "shape": [1, 5], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [5], "dtype": "float32"}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "dense_2/kernel", "shape": [50, 1], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [1], "dtype": "float32"}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "lstm_1/kernel", "shape": [5, 200], "dtype": "float32"}, {"name": "lstm_1/recurrent_kernel", "shape": [50, 200], "dtype": "float32"}, {"name": "lstm_1/bias", "shape": [200], "dtype": "float32"}], "paths": ["group3-shard1of1"]}]}