{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_1/kernel", "shape": [4, 47], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [47], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "dense_2/kernel", "shape": [50, 4], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "lstm_1/kernel", "shape": [47, 200], "dtype": "float32"}, {"name": "lstm_1/recurrent_kernel", "shape": [50, 200], "dtype": "float32"}, {"name": "lstm_1/bias", "shape": [200], "dtype": "float32"}]}], "modelTopology": {"backend": "tensorflow", "training_config": {"sample_weight_mode": null, "loss": "mean_squared_error", "metrics": [], "loss_weights": null, "optimizer_config": {"config": {"lr": 0.0010000000474974513, "epsilon": 1e-07, "decay": 0.0, "rho": 0.8999999761581421}, "class_name": "RMSprop"}}, "model_config": {"config": [{"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "batch_input_shape": [null, 10, 4], "name": "dense_1", "units": 47, "bias_regularizer": null, "activation": "relu", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "unroll": false, "bias_constraint": null, "name": "lstm_1", "units": 50, "return_sequences": false, "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "implementation": 1, "kernel_regularizer": null, "trainable": true, "return_state": false, "unit_forget_bias": true, "kernel_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "use_bias": true, "activity_regularizer": null, "stateful": false, "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_2", "units": 4, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}, "keras_version": "2.1.5"}}